Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t
The Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t struct represents an RGB color with transparency. The color values must be between 0.0 and 1.0.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Default
The default color, to be used when no more specific color is available.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Dimension
The default color to use for highlight graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Highlight
The default color to use for highlight graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.TextHighlight
The default color to use for highlight text graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.TextBackground
The default color to use for text graphic background.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.TextHighlightBackground
The default color to use for highlight text graphic background.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Warning
The default color to use for warning graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Error
The default color to use for error graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.AxisX
The default color for any graphic associated with the X-axis.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.AxisY
The default color for any graphic associated with the Y-axis.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.AxisZ
The default color for any graphic associated with the Z-axis.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Debug
The default color to use for debug graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Disabled
The default color to use for disabled graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Transparent
The default color to use for invisible graphics.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Red
The red value of the color. The value is between 0.0 and 1.0.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Green
The green value of the color. The value is between 0.0 and 1.0.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Blue
The blue value of the color. The value is between 0.0 and 1.0.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.Opaque
The transparency value of the color. The value is between 0.0
(completely see-through) and 1.0 (completely solid).

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.#ctor(System.Double,System.Double,System.Double,System.Double)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t struct using the given values.
red: The red value of the color, between 0.0 and 1.0.
green: The green value of the color, between 0.0 and 1.0.
blue: The blue value of the color, between 0.0 and 1.0.
opaque: The transparency value of the color,
between 0.0 (completely see-through) and 1.0 (completely solid).

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.#ctor(Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t,System.Double)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t struct using the given values.
color: The color to copy from.
opaque: The transparency value of the color,
{D255958A-8513-4226-94B9-080D98F904A1}between 0.0 (completely see-through) and 1.0 (completely solid).

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.FromRgba(System.UInt32,System.UInt32,System.UInt32,System.UInt32)
Creates a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t struct using the given RGBA values.
red: The red value of the color, between 0 and 255.
green: The green value of the color, between 0 and 255.
blue: The blue value of the color, between 0 and 255.
opaque: The transparency value of the color, between 0 (completely see-through) and 255 (completely solid).
Returns: A new instance of Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t with converted ARGB values ranging from 0.0 to 1.0.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.WithAlpha(System.Double)
Creates a new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t struct with the same RGB values and new opaque value.
opaque: The transparency value of the color, between 0 (completely see-through) and 255 (completely solid).
Returns: A new instance of the Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t struct with the same RGB values and new opaque value.

Tekla.Structures.DirectManipulation.Adapter.Graphics.Native.dotColor_t.ToString
Gets the string representation of the current object.
Returns: The string representation of the current object.